Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28CLD2G.svd
            <register>
               <name>DLKR</name>
               <description>Data Lockdown Register</description>
               <addressOffset>0x900</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DLK0</name>
                     <description>Data Lockdown in Way Number 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLK1</name>
                     <description>Data Lockdown in Way Number 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLK2</name>
                     <description>Data Lockdown in Way Number 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLK3</name>
                     <description>Data Lockdown in Way Number 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLK4</name>
                     <description>Data Lockdown in Way Number 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLK5</name>
                     <description>Data Lockdown in Way Number 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLK6</name>
                     <description>Data Lockdown in Way Number 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLK7</name>
                     <description>Data Lockdown in Way Number 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ILKR</name>
               <description>Instruction Lockdown Register</description>
               <addressOffset>0x904</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ILK0</name>
                     <description>Instruction Lockdown in Way Number 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILK1</name>
                     <description>Instruction Lockdown in Way Number 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILK2</name>
                     <description>Instruction Lockdown in Way Number 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILK3</name>
                     <description>Instruction Lockdown in Way Number 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILK4</name>
                     <description>Instruction Lockdown in Way Number 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILK5</name>
                     <description>Instruction Lockdown in Way Number 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILK6</name>
                     <description>Instruction Lockdown in Way Number 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ILK7</name>
                     <description>Instruction Lockdown in Way Number 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCR</name>
               <description>Debug Control Register</description>
               <addressOffset>0xF40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DCL</name>
                     <description>Disable Cache Linefill</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DWB</name>
                     <description>Disable Write-back, Force Write-through</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPNIDEN</name>
                     <description>SPNIDEN Value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCR</name>
               <description>Prefetch Control Register</description>
               <addressOffset>0xF60</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSET</name>
                     <description>Prefetch Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>NSIDEN</name>
                     <description>Not Same ID on Exclusive Sequence Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLEN</name>
                     <description>INCR Double Linefill Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDEN</name>
                     <description>Prefetch Drop Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLFWRDIS</name>
                     <description>Double Linefill on WRAP Read Disable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATPEN</name>
                     <description>Data Prefetch Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INSPEN</name>
                     <description>Instruction Prefetch Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLEN</name>
                     <description>Double Linefill Enable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POWCR</name>
               <description>Power Control Register</description>
               <addressOffset>0xF80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>STBYEN</name>
                     <description>Standby Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCKGATEN</name>
                     <description>Dynamic Clock Gating Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
