Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28CLD2G.svd
               <register>
                  <name>CFGR</name>
                  <description>PIO Configuration Register</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>FUNC</name>
                        <description>I/O Line Function</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>FUNCSelect</name>
                           <enumeratedValue>
                              <name>GPIO</name>
                              <description>Select the PIO mode for the selected I/O lines.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_A</name>
                              <description>Select the peripheral A for the selected I/O lines.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_B</name>
                              <description>Select the peripheral B for the selected I/O lines.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_C</name>
                              <description>Select the peripheral C for the selected I/O lines.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_D</name>
                              <description>Select the peripheral D for the selected I/O lines.</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_E</name>
                              <description>Select the peripheral E for the selected I/O lines.</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_F</name>
                              <description>Select the peripheral F for the selected I/O lines.</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PERIPH_G</name>
                              <description>Select the peripheral G for the selected I/O lines.</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DIR</name>
                        <description>Direction</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DIRSelect</name>
                           <enumeratedValue>
                              <name>INPUT</name>
                              <description>The selected I/O lines are pure inputs.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>OUTPUT</name>
                              <description>The selected I/O lines are enabled in output.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PUEN</name>
                        <description>Pull-Up Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PUENSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Pull-Up is disabled for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Pull-Up is enabled for the selected I/O lines.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PDEN</name>
                        <description>Pull-Down Enable</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PDENSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Pull-Down is disabled for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Pull-Down is enabled for the selected I/O lines only if PUEN is 0.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IFEN</name>
                        <description>Input Filter Enable</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>IFENSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>The input filter is disabled for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>The input filter is enabled for the selected I/O lines.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>IFSCEN</name>
                        <description>Input Filter Slow Clock Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>IFSCENSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>The glitch filter is able to filter glitches with a duration &lt; tmck/2 for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>The debouncing filter is able to filter pulses with a duration &lt; tdiv_slck/2 for the selected I/O lines.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>OPD</name>
                        <description>Open-Drain</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>OPDSelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SCHMITT</name>
                        <description>Schmitt Trigger</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>SCHMITTSelect</name>
                           <enumeratedValue>
                              <name>ENABLED</name>
                              <description>Schmitt trigger is enabled for the selected I/O lines.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Schmitt trigger is disabled for the selected I/O lines.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DRVSTR</name>
                        <description>Drive Strength</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DRVSTRSelect</name>
                           <enumeratedValue>
                              <name>LO</name>
                              <description>Low drive</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LO2</name>
                              <description>Low drive</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ME</name>
                              <description>Medium drive</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HI</name>
                              <description>High drive</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVTSEL</name>
                        <description>Event Selection</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>EVTSELSelect</name>
                           <enumeratedValue>
                              <name>FALLING</name>
                              <description>Event detection on input falling edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RISING</name>
                              <description>Event detection on input rising edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BOTH</name>
                              <description>Event detection on input both edge</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LOW</name>
                              <description>Event detection on low level input</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Event detection on high level input</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PCFS</name>
                        <description>Physical Configuration Freeze Status (read-only)</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PCFSSelect</name>
                           <enumeratedValue>
                              <name>NOT_FROZEN</name>
                              <description>The fields are not frozen and can be written for this I/O line.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ICFS</name>
                        <description>Interrupt Configuration Freeze Status (read-only)</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>ICFSSelect</name>
                           <enumeratedValue>
                              <name>NOT_FROZEN</name>
                              <description>The fields are not frozen and can be written for this I/O line.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>The fields are frozen and cannot be written for this I/O line. Only a hardware reset can release these fields.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
