Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D28CLD2G.svd
            <register>
               <name>NIEPR</name>
               <description>Normal Interrupt Enable Protection Register</description>
               <addressOffset>0x0084</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NIDPR</name>
               <description>Normal Interrupt Disable Protection Register</description>
               <addressOffset>0x0088</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Disable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NIMPR</name>
               <description>Normal Interrupt Mask Protection Register</description>
               <addressOffset>0x008C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector Protection Interrupt Mask</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WKPR</name>
               <description>Wakeup Protection Register</description>
               <addressOffset>0x0090</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DET0</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET1</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET2</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET3</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET4</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET5</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET6</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DET7</name>
                     <description>PIOBU Intrusion Detector Protection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
